brew "fish"
brew "starship"
brew "eza"
brew "zoxide"
brew "fzf"
brew "dua-cli"
brew "yazi"
brew "sevenzip"
brew "jq"
brew "ffmpeg"
brew "poppler"
brew "fd"
brew "rg"
brew "ripgrep"
brew "resvg"
brew "imagemagick"
brew "chezmoi"
brew "nvim"
brew "lazygit"
brew "gh"
brew "node"
brew "pnpm"
brew "helix"

cask "ghostty"
cask "claude-code"
cask "podman-desktop"
cask "font-jetbrains-mono-nerd-font"
cask "font-symbols-only-nerd-font"

tap "oven-sh/bun"
brew "bun"
