# Development Tools & Languages
brew "node"
brew "uv"
tap "oven-sh/bun"
brew "bun"
tap "tursodatabase/tap"
brew "turso"

# Node.js Package Managers
brew "fnm"
brew "pnpm"
brew "yarn"

# Text Editors & IDEs
brew "helix"
brew "nvim"

# Version Control & Git Tools
brew "git"
brew "gh"
brew "lazygit"
brew "jj"
brew "jjui"

# Shell & Terminal
brew "fish"
brew "nushell"
brew "starship"
brew "zellij"

# File Management & Navigation
brew "dua-cli"
brew "eza"
brew "fd"
brew "fzf"
brew "yazi"
brew "zoxide"

# Search & Text Processing
brew "jq"
brew "rg"
brew "ripgrep"

# Media & Image Processing
brew "ffmpeg"
brew "imagemagick"
brew "poppler"
brew "resvg"

# System Tools & Utilities
brew "chezmoi"
brew "sevenzip"

# Docker & Containers
brew "colima"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "lazydocker"

# Security & Networking
brew "openconnect"
brew "pinentry-mac"

# GUI Applications
cask "container"
cask "ghostty"

# AI
brew "codex"
cask "claude"
cask "claude-code"

# Fonts
cask "font-jetbrains-mono-nerd-font"
cask "font-symbols-only-nerd-font"
